{
/* Passphrase panel titles */
"MESSAGE_AUTHENTICATION_TITLE" = "Autenticazione del messaggio";
"MESSAGE_DECRYPTION_PASSPHRASE_TITLE" = "Decifrazione del messaggio";

/**/
"DECRYPTING" = "Sto decifrando...";
"ENCRYPTING" = "Sto cifrando...";

/* <PGP> submenu title */
"PGP_MENU" = "PGP";
/* <PGP Keys> submenu title */
"PGP_KEYS_MENU" = "Chiavi PGP";

/* <PGP> submenu items */
"DECRYPT_MENU" = "Decifra";
"AUTHENTICATE_MENU" = "Autentica";
"ENCRYPT_MENU" = "Cifra nuovo messaggio";
"SIGN_MENU" = "Firma nuovo messaggio";

/* Description of version prefixed with <Version:> */
"VERSION: %@" = "Versione: %@";

/* PGP preferences panel name */
"PGP_PREFERENCES" = "PGP";

/* Alert title and message */
"MSG_DECRYPTION_ALERT_TITLE_NOT_SIGNED" = "Decifrazione del messaggio";
"DECRYPTED_MSG_NOT_SIGNED" = "Il messaggio è stato cifrato ma non firmato. La sua autenticità non può essere provata.";
"MSG_ENCRYPTION_ALERT_TITLE" = "Cifratura PGP fallita";
"MSG_DECRYPTION_ALERT_TITLE" = "Decifratura PGP fallita";
"MSG_SIGNING_ALERT_TITLE" = "Firma PGP fallita";
"UNSUPPORTED_ENCRYPTION_FORMAT" = "GPGMail non può decifrare questo tipo di messaggio cifrato.";
"DATA_NOT_AVAILABLE" = "Il contenuto del messaggio non è temporaneamente disponibile.";

/* Informational alert title and message */
"AUTHENTICATION_TITLE_OK" = "Autenticazione PGP";

/**/
"AUTHENTICATION_TITLE_FAILED" = "Autenticazione PGP fallita";
"TRY_AGAIN" = "Prova ancora";
"CANCEL_DELIVERY" = "Cancella";
"CANCEL_DECRYPTION" = "Cancella";

/**/
"AUTHENTICATION_TITLE_UNSIGNED" = "Autenticazione PGP";
"UNSIGNED_PGP_MESSAGE" = "Questo messaggio non è firmato con PGP.";

/* Toolbar item titles */
"DECRYPT_ITEM" = "Decifra";
"AUTHENTICATE_ITEM" = "Autentica";
"MAKE_ENCRYPTED_ITEM" = "Cifra";
"MAKE_CLEAR_ITEM" = "Non cifrare";
"MAKE_UNSIGNED_ITEM" = "Non firmare";
"MAKE_SIGNED_ITEM" = "Firma";
"ENCRYPTED_ITEM" = "Cifrato";
"CLEAR_ITEM" = "In chiaro";
"SIGNED_ITEM" = "Firmato";
"UNSIGNED_ITEM" = "Non firmato";

/* Toolbar item tooltips  */
"DECRYPT_ITEM_TOOLTIP" = "Decifra il messaggio cifrato con PGP";
"AUTHENTICATE_ITEM_TOOLTIP" = "Autentica il messaggio firmato con PGP";
"MAKE_CLEAR_ITEM_TOOLTIP" = "Clicca per inviare un messaggio in chiaro";
"MAKE_ENCRYPTED_ITEM_TOOLTIP" = "Clicca per usare la cifratura di PGP";
"MAKE_UNSIGNED_ITEM_TOOLTIP" = "Clicca per inviare un messaggio senza l'autenticazione di PGP";
"MAKE_SIGNED_ITEM_TOOLTIP" = "Clicca per usare l'autenticazione di PGP";
"ENCRYPTED_ITEM_TOOLTIP" = "Il messaggio verrà cifrato; clicca per inviare un messaggio in chiaro";
"CLEAR_ITEM_TOOLTIP" = "Il messaggio sarà in chiaro; clicca per usare la cifratura di PGP";
"SIGNED_ITEM_TOOLTIP" = "Il messaggio sarà firmato con PGP; clicca per inviare un messaggio senza l'autenticazione di PGP";
"UNSIGNED_ITEM_TOOLTIP" = "Il messaggio non verrà firmato con PGP; clicca per usare l'autenticazione di PGP";

/* Signature information */
"Bad policy!"  = "Procedura sbagliata! "; // Followed by a list of policy URLs
"Policy: " = "Procedura: "; // Followed by a list of policy URLs
"Signed on %@" = "Firmato %@"; // Param is a date, whose format is set by SIGNATURE_CREATION_DATE_FORMAT
"SIGNATURE_CREATION_DATE_FORMAT" = "%c"; // See NSCalendarDate documentation for format
"No signature creation date available" = "Non è disponibile la data di creazione della firma";
"Key fingerprint: %@" = "Impronta della chiave: %@";
"Key ID: 0x%@" = "ID della chiave: 0x%@";
"No key fingerprint/ID available" = "Nessuna impronta/ID della chiave disponibile";
"Validity: %@" = "Validità: %@"; // Param is the validity status string
"Signature expires on %@" = "La firma scade il %@"; // Param is a date, whose format is set by SIGNATURE_EXPIRATION_DATE_FORMAT
"SIGNATURE_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Key expired on %@" = "La chiave scade il %@"; // Param is a date, whose format is set by KEY_EXPIRATION_DATE_FORMAT
"KEY_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Signed by %@." = "Firmato da %@."; // Param is a userID
"Signature from %@ is bad!" = "La firma di %@ è sbagliata!"; // Param is a userID
"Signature is bad!" = "Firma sbagliata!";
"Signature status error." = "Errore nella firma.";
"MISSING KEY %@." = "Manca la chiave %@."; // Param is a key ID in hexadecimal
"Signature summary 0x%04x - Signature status %u." = "Errore sconosciuto: firma 0x%04x - stato %u."; // Generic error message; first param is a hex status flag value, second is a decimal status value
"EXCEPTION: %@" = "Errore interno: %@"; // Generic error message; param is a string (exception reason, maybe not localized)
"AUTHENTICATING" = "Sto verificando la firma PGP...";
"UNTRUSTED RECIPIENTS" = "Almeno una delle chiavi non è fidata";

/* Title */
/* Error messages */
"GPGMAIL_CANNOT_WORK" = "GPGMail non può funzionare perchè l'applicazione su cui si appoggia non può essere fatta partire. Prova a riavviare Mail, se l'errore persiste manda un messaggio a gpgmail@sente.ch";
"GPGMAIL_CANNOT_WORK_HAS_GPG_%@_VERSION_%@_NEEDS_%@" = "GPGMail non può funzionare. Ha trovato installato GnuPG (%@) versione %@; per funzionare correttamente ha bisogno almeno della versione %@. Perfavore esci da Mail, installa una versione corretta di GnuPG (per esempio scaricandola dal MacGPG Project, http://macgpg.sourceforge.net/), e poi fai ripartire Mail."; // First arg is path to gpg, second and third are version strings
"GPGMAIL_CANNOT_WORK_MISSING_GPG_%@_VERSION_%@" = "GPGMail non può funzionare. Non ha trovato installato GnuPG (%@) con almeno la versione %@. Perfavore esci da Mail, installa una versione corretta di GnuPG (per esempio scaricandola dal MacGPG Project, http://macgpg.sourceforge.net/), e poi fai ripartire Mail."; // First arg is path to gpg, second is version string
"INVALID_GPGMAIL_VERSION" = "Questa versione di GPGMail non è compatibile con la tua versione di Mail."; /* Title of alert sheet */
"NEEDS_COMPATIBLE_BUNDLE_VERSION" = "Devi scaricare e installare la versione di GPGMail compatibile con la tua versione del sistema operativo. Vai a http://www.sente.ch/software/GPGMail/ per scaricarla.";

/* Validity */
"VALIDITY: " = "validità: ";
"Validity=0" = "sconosciuta";
"Validity=1" = "non definita";
"Validity=2" = "mai";
"Validity=3" = "parziale";
"Validity=4" = "piena";
"Validity=5" = "ultimate";

/* Generic MacGPGME error messages */
"GPGErrorCode=1" = "Errore generale";
"GPGErrorCode=8" = "Firma sbagliata";
"GPGErrorCode=9" = "Nessuna chiave pubblica";
"GPGErrorCode=10" = "Errore di checksum";
"GPGErrorCode=11" = "Frase chiave sbagliata";
"GPGErrorCode=15" = "Invalid armor";
"GPGErrorCode=17" = "Nessuna chiave segreta";
"GPGErrorCode=31" = "Frase chiave invalida";
"GPGErrorCode=40" = "Errore del server delle chiavi";
"GPGErrorCode=53" = "Chiave pubblica non utilizzabile";
"GPGErrorCode=54" = "Chiave segreta non utilizzabile";
"GPGErrorCode=55" = "Valore non valido";
"GPGErrorCode=58" = "Nessuna data";
"GPGErrorCode=69" = "Non implementato";
"GPGErrorCode=84" = "Algoritmo non utilizzato";
"GPGErrorCode=94" = "Chiave revocata";
"GPGErrorCode=99" = "Cancellato";
"GPGErrorCode=107" = "Nome ambiguo";
"GPGErrorCode=116" = "Nessuna corrispondenza nella procedura";
"GPGErrorCode=125" = "Utilizzo sbagliato della chiave";
"GPGErrorCode=150" = "Procedura non valida";
"GPGErrorCode=151" = "Chiave pubblica non fidata";
"GPGErrorCode=152" = "Decifratura fallita";
"GPGErrorCode=153" = "Chiave scaduta";
"GPGErrorCode=154" = "Firma scaduta";
"GPGErrorCode=16383" = "EOF";

/* Signature attachment filename (suffixed automatically by .sig) */
"PGP_SIGNATURE_FILENAME" = "PGP";

/* Signature attachment content-description */
"This is a digitally signed message part" = "Questa è un messaggio firmato elettronicamente";

/* Version MIME part content description header */
"CONTENT_DESCRIPTION_HEADER" = "PGP/MIME version identification";

/* Encrypted attachment filename (suffixed automatically by .asc) */
"PGP_ENCRYPTED_FILENAME" = "PGP";

/* Encrypted attachment content-description */
"This is an encrypted message part" = "Questo è un messaggio cifrato";

/* Multiple-part description */
"MULTIPART_ENCRYPTED_DESCRIPTION" = "This is an OpenPGP/MIME encrypted message (RFC 2440 and 3156)";
"MULTIPART_SIGNED_DESCRIPTION" = "This is an OpenPGP/MIME signed message (RFC 2440 and 3156)";

/* Tooltip for banner icons */
"SIGNATURE_IS_GOOD" = "La firma è stata verificata; il messaggio non è stato modificato";
"SIGNATURE_IS_NOT_GOOD" = "La firma non è valida; il messaggio è stato alterato";

/* PGP Key Download panel */
"PGP_SEARCH_KEYS_MENUITEM" = "Ricerca della chiave PGP";
"SEARCH" = "Cerca";
"CANCEL_SEARCH" = "Cancella";
"SEARCHING" = "Sto cercando...";
"NO_MATCHING_KEYS" = "Non ho trovato nessuna chiave corrispondente";
"FOUND_%d_KEYS" = "Ho trovato %d chiave(i)";
"DOWNLOAD" = "Scarico";
"DOWNLOADING" = "Sto scaricando...";
"DOWNLOADED" = "Chiave(i) scaricata(e) e importata(e)";
"SEARCH_KEYS_ON_SERVER" = "Cerca le chiavi PGP nel server delle chiavi";
"DOWNLOAD_KEYS_FROM_SERVER" = "Scarica le chiavi PGP dal server delle chiavi";
"SEARCH_ERROR" = "C'è stato un errore durante la ricerca";
"DOWNLOAD_ERROR" = "C'è stato un errore durante lo scaricamento";
" (%u bits)" = " (%u bits)";
", created on %@" = ", creata il %@";
", expires on %@" = ", scade il %@";
", expired on %@" = ", expired on %@";
"REVOKED_KEY - " = "Revocata - "; // Prefixes found key description, when necessary; followed by keyID, userID, etc.

/* Unmatched PGP keys for receipts - sheet */
"MISSING_KEYS: DOWNLOAD" = "Ad alcuni indirizzi non è associata una chiave PGP. Cercare queste chiavi?"; // Title
"UNMATCHED_ADDRESSES: %@" = "Questo indirizzo email non ha una chiave PGP:\n%@"; // Message
"SEARCH_MATCHING_KEYS" = "Cerca"; // Default button
"SEND_IN_CLEAR" = "Invia in chiaro"; // button title; used in dialog after delivery failure due to missing public keys

"INVALID_HASH_%@" = "L'algoritmo di hash '%@' non è consentito dall'RFC3156.";
"GPGMAIL_VS_PGPMAIL" = "GPGMail non può funzionare quando PGPmail è installato";
"GPGMAIL_%@_VS_PGPMAIL_%@" = "Entrambi i pacchetti forniscono le stesse funzionalità con modalità di funzionamento differenti. Soltanto uno dei due può essere installato. Devi rimuovere '%@', o '%@'.";
"QUIT" = "Esci";
"CONTINUE_ANYWAY" = "Prova comunque a continuare"; // Used as button title in modal sheet (PGPmail vs GPGMail)

/* Composer accessory view header, under To:, CC:, Subject: */
"PGP:" = "PGP:";

/* Key description in popups; prefixes key (actually, primary userID), when necessary; followed by keyID, userID, etc.*/
"REVOKED_KEY:" = "Revocata:";
"EXPIRED_KEY:" = "Scaduta:";
"DISABLED_KEY:" = "Disabilitata:";
"INVALID_KEY:" = "Invalida:";

/* UserID description in popups; prefixes userID, when necessary; followed by name, email, etc.*/
"REVOKED_USER_ID:" = "Revocata:";
"INVALID_USER_ID:" = "Invalida:";

/* GPGMail exception reasons */
"NO_VALID_PUBLIC_KEY" = "Non sono state trovate chiavi pubbliche valide. Sono tutte scadute, disabilitate o revocate."; // Could be displayed after encryption
"NO_VALID_PRIVATE_KEY" = "Non sono state trovate chiavi private valide. Questo perchè non ne è stata selezionata nessuna o quella scelta è stata revocata, disabilitata o è scaduta."; // Could be displayed after encryption

/* Alert when user has no PGP key */
"NO PGP PRIVATE KEY - TITLE" = "Non hai nessuna chiave PGP. Non puoi usare GPGMail per cifrare o per firmare i messaggi.";
"NO PGP PRIVATE KEY - MESSAGE" = "Se vuoi cifrare o firmare i messaggi con PGP hai bisogno di una chiave PGP personale. Per creare una chiave PGP personale scarica e utilizza il programma GPG Keychain Access di MacGPG che puoi trovare a  http://macgpg.sourceforge.net/";

/* Conflict resolution panel*/
"<ME>" = "Me";
"<YES>" = "Yes";
"<NO>" = "No";
"<ALWAYS>" = "Always";
"<NEVER>" = "Never";
"<ACCEPTS>" = "Accepts";

/* Additional info describing key */
"DISABLED_KEY_QUALIFIER" = "disabilitata";
"INVALID_KEY_QUALIFIER" = "invalida";
"REVOKED_KEY_QUALIFIER" = "revocata";
"EXPIRED_KEY_QUALIFIER" = "scaduta";
"CANNOT_ENCRYPT_KEY_QUALIFIER" = "cannot encrypt";
"CANNOT_SIGN_KEY_QUALIFIER" = "cannot sign";

/* Additional info describing userID */
"INVALID_USER_ID_QUALIFIER" = "invalida";
"REVOKED_USER_ID_QUALIFIER" = "revocata";

"COPY_MSG_URL_MENUITEM" = "Copy Message URL";
}